marcelpetrick/esp32Collection/esp32cam/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# PSRAM — required for camera framebuffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_CACHE_WORKAROUND=y

# Partition table — 4MB flash, no OTA
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# HTTP server — allow long-running stream connections
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
